module.exports = {
    "chat":{
        "header_msg":"Режим диалога | [model] | [response_style]",
        "welcome_msg": "Напишите сообщение, чтобы начать новый диалог.",
        "incomplete_msg":"Размер диалога = [previous_dialogue_tokens] токенов (из [request_length_limit_in_tokens]).\n" +
                        "Чтобы начать новый диалог, нажмите здесь: /resetchat. ",
        "name":"Диалог",
        "options_desc":"Параметры работы Диалога:",
        "options":{
            "temperature":{
                "name":"Температура (t°)",
                "options_desc":"Выберите новое значение температуры:",
                "templateRespMsg":"Параметр Температура (t°) для функции Диалог изменен на [value].",
                "options":{
                "0":{
                    "name":"0",
                },
                "0.25":{
                "name":"0.25",
                },
                "0.5":{
                "name":"0.5",
                },
                "0.75":{
                "name":"0.75",
                },
                "1":{
                "name":"1",
                },
                "back":{
                    "name":"<< Назад"
                }
            }},
            "model":{
                "name":"Версия модели",
                "options_desc":"Выберите версию модели:",
                "templateRespMsg":"Модель для функции Диалог изменена на [value].",
                "options":{
                    "gpt-4o":{
                        "name":"gpt-4o",
                    },
                    "gpt-4.1":{
                        "name":"GPT-4.1",
                    },
                    "gpt-4.1-mini":{
                        "name":"GPT-4.1 mini",
                    },
                    "o1":{
                        "name":"O1",
                    },
                    "gpt-4o-search-preview":{
                            "name":"GPT Search",
                    },
                    "gpt-4o-mini-search-preview":{
                            "name":"GPT Search Mini",
                    },
                    "o3-mini":{
                        "name":"O3 Мини",
                    },
                    "back":{
                        "name":"<< Назад"
                    }
            }},
            "response_style":{
                "name":"Стиль ответов",
                "options_desc":"Выберите стиль ответов:",
                "templateRespMsg":"Стиль ответов изменен на [value].",
                "options":{
                    "gentleman":{
                        "name":"Джентльмен",
                    },
                    "lady":{
                        "name":"Леди",
                    },
                    "criminal":{
                        "name":"Уголовник",
                    },
                    "philosopher":{
                        "name":"Философ",
                    },
                    "hacker":{
                        "name":"Хакер",
                    },
                    "peabody":{
                        "name":"Мистер Пибоди",
                    },
                    "genie":{
                        "name":"Джинни🧞‍♂️",
                    },
                    "neutral":{
                        "name":"Нейтральный",
                    },
                    "friendly":{
                        "name":"Приветливый",
                    },
                    "back":{
                        "name":"<< Назад"
                    }
            }
            },
            "back":{
                "name":"<< Назад"
            }
        },
        "hostname":`https://${process.env.OAI_URL}`,
        "default_model":'gpt-4.1',
        "url_path":'/v1/chat/completions',
        "default_dialogue_ttl_ms":3600000,
    },
    "translator":{
        "header_msg":"Переводчик | [model]",
        "welcome_msg":"Достаточно прислать текст. Русский текст будет переведен на английский. Текст на любом другом языке будет переведен на русский." ,
        "name":"Переводчик",
        "options_desc":"Параметры работы Переводчика:",
        "options":{
            "temperature":{
                "name":"Температура (t°)",
                "options_desc":"Выберите новое значение температуры:",
                "templateRespMsg":"Параметр Температура (t°) для Переводчика изменен на [value].",
                "options":{
                "0":{
                    "name":"0",
                },
                "0.25":{
                "name":"0.25",
                },
                "0.5":{
                "name":"0.5",
                },
                "0.75":{
                "name":"0.75",
                },
                "1":{
                "name":"1",
                },
                "back":{
                    "name":"<< Назад"
                }
            }},
            "model":{
                "name":"Версия модели",
                "options_desc":"Выберите версию модели:",
                "templateRespMsg":"Модель для режима Переводчик изменена на [value].",
                "options":{
                    "gpt-4.1":{
                        "name":"GPT-4.1",
                    },
                    "o1":{
                        "name":"O1",
                    },
                    "o3-mini":{
                        "name":"O3 Мини",
                    },
                    "back":{
                        "name":"<< Назад"
                    }
            }},
            "back":{
                "name":"<< Назад"
            }
        },
        "hostname":`https://${process.env.OAI_URL}`,
        "default_model":'gpt-4o',
        "url_path":'/v1/chat/completions',
        "default_dialogue_ttl_ms":3600000,
    },
    "texteditor":{
        "header_msg":"Редактор | [model]",
        "welcome_msg":"Просто пришлите Ваш текст в виде сообщения и я помогу его отредактировать." ,
        "name":"Редактор",
        "options_desc":"Параметры работы Редактора:",
        "options":{
            "temperature":{
                "name":"Температура (t°)",
                "options_desc":"Выберите новое значение температуры:",
                "templateRespMsg":"Параметр Температура (t°) для Редактора изменен на [value].",
                "options":{
                "0":{
                    "name":"0",
                },
                "0.25":{
                "name":"0.25",
                },
                "0.5":{
                "name":"0.5",
                },
                "0.75":{
                "name":"0.75",
                },
                "1":{
                "name":"1",
                },
                "back":{
                    "name":"<< Назад"
                }
            }},
            "model":{
                "name":"Версия модели",
                "options_desc":"Выберите версию модели:",
                "templateRespMsg":"Модель для режима Редактор изменена на [value].",
                "options":{
                    "gpt-4.1":{
                        "name":"GPT-4.1",
                    },
                    "o1":{
                        "name":"O1",
                    },
                    "o3-mini":{
                        "name":"O3 Мини",
                    },
                    "back":{
                        "name":"<< Назад"
                    }
            }},
            "back":{
                "name":"<< Назад"
            }
        },
        "hostname":`https://${process.env.OAI_URL}`,
        "default_model":'gpt-4o',
        "url_path":'/v1/chat/completions',
        "default_dialogue_ttl_ms":3600000,
    },
    "texttospeech":{
        "header_msg":"Текст в голос | [voice]",
        "welcome_msg":"Преобразовывает текст в аудио запись. Пришлите текст, который нужно преобразовать. Длина текста не должна превышать [limit] символов.",
        "name":"Текст в голос",
        "hostname":`https://${process.env.OAI_URL}`,
       // "default_model":'tts-1-hd',
        "default_model":'gpt-4o-mini-tts',
        "url_path":'/v1/audio/speech',
        "response_format":"json",
        "voice": "Sarah",
        "options_desc":"Параметры работы функции Текст в голос:",
        "options":{
            "voice":{
                "name":"Версия голоса",
                "options_desc":"Выберите версию голоса:",
                "templateRespMsg":"Голос изменен на [value].",
                "options":{
                    "Paul":{
                        "name":"Пол",
                    },
                    "Sarah":{
                        "name":"Сара",
                    },	
                    "Callum":{
                        "name":"Калум",
                    },
                    "back":{
                        "name":"<< Назад"
                    }
            }},
            "back":{
                "name":"<< Назад"
            }
        }
    },
    "currentsettings":{
        "name":"Текущие настройки",
    },
    };